app/Http/Controllers/Owner/ImageController.php

select * from `images` where `images`.`id` = '1' limit 1
select * from `owners` where `owners`.`id` = 2 and `owners`.`deleted_at` is null limit 1
---
    public function __construct()
    {
        $this->middleware('auth:owners');

        $this->middleware(function ($request, $next) {

            $id = $request->route()->parameter('image');
            if(!is_null($id)){
            $imagesOwnerId = Image::findOrFail($id)->owner->id;

select * from `images` where `owner_id` = 2 order by `updated_at` desc limit 20 offset 0
select count(*) as aggregate from `images` where `owner_id` = 2
---
    public function index()
    {
        $images = Image::where('owner_id', Auth::id())
        ->orderBy('updated_at', 'desc')
        ->paginate(20);

select * from `images` where `images`.`id` = '6' limit 1
---
    public function edit(string $id)
    {
        $image = Image::findOrFail($id);

select * from `images` where `images`.`id` = '1' limit 1
---
    public function destroy(string $id)
    {
        $image = Image::findOrFail($id);