app/Http/Controllers/Owner/ProductController.php

select `id`, `name` from `shops` where `owner_id` = 1
select `id`, `title`, `filename` from `images` where `owner_id` = 1 order by `updated_at` desc
select * from `primary_categories`
---
    public function create()
    {
        $shops = Shop::where('owner_id', Auth::id())
        ->select('id', 'name')
        ->get();

        $images = Image::where('owner_id', Auth::id())
        ->select('id', 'title', 'filename')
        ->orderBy('updated_at', 'desc')
        ->get();

        $categories = PrimaryCategory::with('secondary')
        ->get();