app/Http/Controllers/Admin/OwnersController.php

select * from `owners` where `owners`.`deleted_at` is null
select `name`, `created_at` from `owners`
select `id`, `name`, `email`, `created_at` from `owners` where `owners`.`deleted_at` is null limit 3 offset 0
select count(*) as aggregate from `owners` where `owners`.`deleted_at` is null
---
    public function index()
    {
        $date_now = Carbon::now();
        $date_parse = Carbon::parse(now());
        echo $date_now->year;
        echo $date_parse;

        $e_all = Owner::all();
        $q_get = DB::table('owners')->select('name','created_at')->get();
        // $q_first = DB::table('owners')->select('name')->first();

        // $c_test = collect([
        //     'name' => 'てすと'
        // ]);

        // dd($e_all, $q_get, $q_first, $c_test);

        $owners = Owner::select('id', 'name', 'email', 'created_at')
        ->paginate(3);

insert into `owners` (`name`, `email`, `password`, `updated_at`, `created_at`) values ('majan', 'majan@majan.com', '$2y$10$fwEGhu4K5.oX2GuN7cXX3eo9oicfcfG2ZlJTNwoyg5sz/zuc968dq', '2023-07-08 09:19:43', '2023-07-08 09:19:43')
---
    public function store(Request $request)
    {
        //$request->name;
        $request->validate([
            'name' => 'required|string|max:255',
            'email' => 'required|string|email|max:255|unique:owners',
            'password' => 'required|string|confirmed|min:8',
        ]);

        try{
            DB::transaction(function () use($request) {
                $owner = Owner::create([
                    'name' => $request->name,
                    'email' => $request->email,
                    'password' => Hash::make($request->password),
                ]);

select * from `owners` where `owners`.`id` = '1' and `owners`.`deleted_at` is null limit 1
---
    public function edit(string $id)
    {
        $owner = Owner::findOrFail($id);

select * from `owners` where `owners`.`deleted_at` is not null
---
    public function update(Request $request, string $id)
    {
        $owner = Owner::findOrFail($id);
        $owner->name = $request->name;
        $owner->email = $request->email;
        $owner->password = Hash::make($request->password);
        $owner->save();

        return redirect()
        ->route('admin.owners.index')
        ->with(['message' => 'オーナー情報を更新しました。',
        'status' => 'info']);